Revit 2027 API
CurveElement.GetAreaBasedLoadBoundaryLineData Method
 Gets the area based load boundary line data from this curve, if applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaBasedLoadBoundaryLineData GetAreaBasedLoadBoundaryLineData()
Public Function GetAreaBasedLoadBoundaryLineData As AreaBasedLoadBoundaryLineData
public:
AreaBasedLoadBoundaryLineData^ GetAreaBasedLoadBoundaryLineData()
member GetAreaBasedLoadBoundaryLineData : unit -> AreaBasedLoadBoundaryLineData
Return Value
AreaBasedLoadBoundaryLineData
 The area based load boundary line data, if this is an area based load boundary, or null otherwise.
Remarks
 Will return null if curve element isn't an area based load boundary line.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace